Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetSnapshotFromDatabase(Tekla.Structures.DrawingInternal.dotEnumerator_t@,System.Collections.Generic.List{System.Object}@,System.Boolean)
Enumerator:
SerializedObjects:
SelectInstances:
Returns:

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Wraps Level Mark Attributes Handler
pLevelMarkAttributes: .Net Level Mark Attributes
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Wraps Level Mark Handler
pLevelMark: .Net Level Mark
Returns: Result of request

Tekla.Structures.DrawingInternal.CDelegateWrapper.GetDrawingViewVisibilityFilterValue(System.Int32,System.String@)
Gets the drawing view visibility filter value.
drawingViewId: The drawing view id.
drawingViewVisibilityFilterValue: The drawing view visibility filter value.
Returns: True if the drawing view visibility filter value was succesfully returned.

Tekla.Structures.DrawingInternal.CDelegateWrapper.GetRaiseReadWindowsNamesByViewIds(System.Int32,System.Int32)
Raises the read windows names by view ids BIM message.
modelViewId: The model view id.
drawingViewId: The drawing view id.
Returns: True if the windows names were successfully read.

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetDrawingReadyForIssuingChangeEvent(System.String@)


Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
ARGB: Color structure defining alpha, red, green, blue values.
Returns: TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
ColorIndex: TS globally unique color index.
ARGB: Color structure defining alpha, red, green, blue values (output).
Returns: true.

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportIsStandardColor(System.Int32)
ColorIndex: TS globally unique color index.
Returns: Non-zero value if the input color is a standard TS color. Zero if it is a user defined color

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetColorIndexFromSaveFormat(System.String)
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: TS globally unique color index.

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetSaveFormatFromColorIndex(System.Int32,System.String@)
ColorIndex: TS globally unique color index.
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: true.

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetAllColorPaletteFiles(Tekla.Structures.DrawingInternal.dotClientId_t)
DO NOT USE! For internal usage only!
Get all color palette file paths, based on the normal file visibility rule
DotClientId:
Returns:

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportShowColorPalette(System.Int32,System.IntPtr)
Shows the color palette dialog.
color: The initial color
hWndOwner: The window handle of the owner window
Returns: The selected color

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportShowColorPaletteForHatchBackground(System.Int32,System.IntPtr)
Shows the color palette dialog for hatch background.
color: The initial color
hWndOwner: The window handle of the owner window
Returns: The selected color

Tekla.Structures.DrawingInternal.CDelegateWrapper.ExportGetPluginInputById(System.Int32,Tekla.Structures.DrawingInternal.dotPluginInput_t@)


Tekla.Structures.DrawingInternal.CDelegateWrapper.GetDrawingRuntimeIdFromFilename(System.String)
